app/controllers/admin/vendors_controller.rb

  def index
    if current_user.mobilecause_admin? && current_user.vendor.present?
---
SELECT  `vendors`.* FROM `vendors` WHERE `vendors`.`id` = 40 LIMIT 1

  def create
    @vendor = Vendor.new(vendor_params)
    p vendor_params
    respond_to do |format|
      if @vendor.save
        @user_params.merge!(vendor_admin: true)
        @vendor.account.users.create(@user_params)
        @vendor.users.each do |user| user.save! end

        @vendor.account.update_attributes(account_status: @account_params) if @account_params.present?
---
INSERT INTO `vendors` (`name`, `email`, `created_at`, `updated_at`) VALUES ('fdsfdas', 'rinr@yahoo.com', '2019-01-31 17:43:05.967704', '2019-01-31 17:43:05.967704')
INSERT INTO `accounts` (`accountable_type`, `accountable_id`, `created_at`, `updated_at`) VALUES ('Vendor', 2, '2019-01-28 05:32:06.926354', '2019-01-28 05:32:06.926354')
INSERT INTO `users` (`email`, `encrypted_password`, `vendor_admin`, `account_id`, `created_at`, `updated_at`) VALUES ('tim@mobilecause.com', '$2a$11$42cR5Jkm/0NECm..hyblIuwaLf56a7ADSo/4O7iOdzIGvazfZno76', 1, 41, '2019-01-31 23:30:01.209597', '2019-01-31 23:30:01.209597')
SELECT  `users`.* FROM `users` WHERE `users`.`account_id` = 3  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1