app/controllers/users_controller.rb

  def become
    user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4  ORDER BY `users`.`id` ASC LIMIT 1