app/views/admin/vendors/new.html.haml

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
---
          = f.label :account_status, 'Account Status'
          = f.select :account_status, options_for_select({ 'Enabled' => Account::AccountStatus::ENABLED, 'Disabled' => Account::AccountStatus::DISABLED }, @vendor.account.enabled? ? 1 : 0), {}, { class: 'form-control' }