app/views/accounts/_settings_panel.html.haml

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
---
                    - statuses = {'Enabled' => Account::AccountStatus::ENABLED, 'Disabled' => Account::AccountStatus::DISABLED}
                    = f.select :account_status, options_for_select(statuses, @vendor.account.account_status), {}, class: 'form-control input-small'
              .submit.top-medium