app/views/accounts/_vendor_feature_settings.html.haml

    %tbody
      - Feature.displayable_list.each do |available_feature|
---
SELECT `features`.* FROM `features` WHERE `features`.`vendor_id` = 40